TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_aesadvhp.h
/*
 * Copyright (c) 2025, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_aesadvhp.h
 *  @brief      Advanced Encryption Standard Advanced (AESADVHP) Driver Library
 *  @defgroup   AESADVHP Advanced Encryption Standard Advanced (AESADVHP)
 *
 *  @anchor ti_dl_dl_aesadv_Overview
 *  # Overview
 *
 *  The AESADVHP DriverLib allows full configuration of the MSPM0 AESADVHP module.
 *  The AESADVHP accelerator module accelerates encryption and decryption
 *  operations in hardware based on the FIPS PUB 197 advanced encryption
 *  standard (AES).
 *
 *  <hr>
 ******************************************************************************/
/** @addtogroup AESADVHP
 * @{
 */

#ifndef ti_dl_dl_aesadvhp__include
#define ti_dl_dl_aesadvhp__include

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>

#ifdef __MSP_HAS_AESADVHP__

#ifdef __cplusplus
extern "C"
{
#endif

    /* clang-format off */

/** @addtogroup DL_AESADVHP_INTERRUPT
 *  @{
 */

/*!
 *  @brief AESADVHP Output Ready interrupt
 *
 *  @note Not compatible with the use of @ref DL_AESADVHP_enableDMAOperation
 */
#define DL_AESADVHP_INTERRUPT_OUTPUT_READY                                       \
                                       (AESADVHP_INT_EVENT0_IMASK_OUTPUTRDY_SET)

/*!
 *  @brief AESADVHP Input Ready interrupt
 *
 *  @note Not compatible with the use of @ref DL_AESADVHP_enableDMAOperation
 */
#define DL_AESADVHP_INTERRUPT_INPUT_READY                                        \
                                        (AESADVHP_INT_EVENT0_IMASK_INPUTRDY_SET)

/*!
 *  @brief AESADVHP Saved Context Ready interrupt. TAG and/or IV blocks are
 *         available to be retrieved by the CPU.
 */
#define DL_AESADVHP_INTERRUPT_SAVED_OUTPUT_CONTEXT_READY                         \
                                   (AESADVHP_INT_EVENT0_IMASK_SAVEDCNTXTRDY_SET)

/*!
 *  @brief AESADVHP Context Ready interrupt. Context bits can be overwritten.
 */
#define DL_AESADVHP_INTERRUPT_INPUT_CONTEXT_READY                                \
                                        (AESADVHP_INT_EVENT0_IMASK_CNTXTRDY_SET)

/** @}*/

/** @addtogroup DL_AESADVHP_EVENT
 *  @{
 */

/*!
 *  @brief DMA Trigger Event used to request the DMA write to DATAIN
 */
#define DL_AESADVHP_EVENT_DMA_DATA_INPUT_TRIGGER                                 \
                                           (AESADVHP_INT_EVENT1_IMASK_TRIG0_SET)

/*!
 *  @brief DMA Trigger Event used to request the DMA read from DATAOUT
 */
#define DL_AESADVHP_EVENT_DMA_DATA_OUTPUT_TRIGGER                                \
                                           (AESADVHP_INT_EVENT2_IMASK_TRIG1_SET)

/** @}*/

/*!
 *  @brief AESADVHP Mode mask for all modes
 */
#define DL_AESADVHP_MODE_MASK                        ((AESADVHP_CTRL_CBC_MASK) | \
                (AESADVHP_CTRL_CTR_MASK)     |      (AESADVHP_CTRL_ICM_MASK) | \
                (AESADVHP_CTRL_CFB_MASK)     |   (AESADVHP_CTRL_CBCMAC_MASK) | \
                (AESADVHP_CTRL_GCM_MASK)     |      (AESADVHP_CTRL_CCM_MASK) | \
                (AESADVHP_CTRL_OFB_GCM_CCM_CONT_MASK) | 0x02000000U)

/* TODO: create define once XCBC-MAC MASK defined in IPXACT */

    /* clang-format on */

    /*! @enum DL_AESADVHP_IIDX */
    typedef enum
    {
        /*! AESADVHP interrupt index for input context ready to be written */
        DL_AESADVHP_IIDX_INPUT_CONTEXT_READY        = AESADVHP_INT_EVENT0_IIDX_STAT_CNTXTRDY,
        /*! AESADVHP interrupt index for saved output context (tag/IV) available */
        DL_AESADVHP_IIDX_SAVED_OUTPUT_CONTEXT_READY = AESADVHP_INT_EVENT0_IIDX_STAT_SAVEDCNTXTRDY,
        /*! AESADVHP interrupt index indicating the engine can take more input.
         *  Not compatible with @ref DL_AESADVHP_enableDMAOperation */
        DL_AESADVHP_IIDX_INPUT_READY                = AESADVHP_INT_EVENT0_IIDX_STAT_INPUTRDY,
        /*! AESADVHP interrupt index indicating the engine has available output data.
         *  Not compatible with @ref DL_AESADVHP_enableDMAOperation */
        DL_AESADVHP_IIDX_OUTPUT_READY               = AESADVHP_INT_EVENT0_IIDX_STAT_OUTPUTRDY,
        /*! AES interrupt index for enabling DMA input request trigger event */
        DL_AESADVHP_IIDX_DMA_INPUT_TRIGGER          = AESADVHP_INT_EVENT1_IIDX_STAT_TRIG0,
        /*! AES interrupt index for enabling DMA output request trigger event */
        DL_AESADVHP_IIDX_DMA_OUTPUT_TRIGGER         = AESADVHP_INT_EVENT2_IIDX_STAT_TRIG1,
    } DL_AESADVHP_IIDX;

    /*! @enum DL_AESADVHP_MODE */
    typedef enum
    {
        /*! Electronic Codebook (ECB) mode */
        DL_AESADVHP_MODE_ECB    = 0x00,
        /*! Cipher Block Chaining (CBC) mode */
        DL_AESADVHP_MODE_CBC    = ( AESADVHP_CTRL_CBC_ENABLE ),
        /*! Counter (CTR) mode */
        DL_AESADVHP_MODE_CTR    = ( AESADVHP_CTRL_CTR_ENABLE ),
        /*! Integer Counter Mode (ICM). ICM is a variant of CTR with a 16-bit wide
         *  counter */
        DL_AESADVHP_MODE_ICM    = ( AESADVHP_CTRL_ICM_ENABLE ),
        /*! Cipher Feedback (CFB) mode */
        DL_AESADVHP_MODE_CFB    = ( AESADVHP_CTRL_CFB_ENABLE ),
        /*! Output Feedback (OFB) mode */
        DL_AESADVHP_MODE_OFB    = ( AESADVHP_CTRL_OFB_GCM_CCM_CONT_OFB ),
        /*! Cipher-based message authentication code (CMAC). */
        DL_AESADVHP_MODE_CMAC   = ( 0x02000000U | AESADVHP_CTRL_CBC_ENABLE ), /* TODO: add CMAC-define when given */
        /*! Cipher block chaining message authentication code (CBC-MAC) mode */
        DL_AESADVHP_MODE_CBCMAC = ( AESADVHP_CTRL_CBCMAC_ENABLE ),
        /* TODO: Update GCM values once new defines in place */
        /*! Galois/Counter Mode (GCM) with GHASH (GHASH_H loaded and Y0-encrypted
         *  forced to 0) */
        DL_AESADVHP_MODE_GCM_FORCE_ZERO    = ( AESADVHP_CTRL_GCM_FORCE_ZERO ) | ( AESADVHP_CTRL_CTR_ENABLE ),
        /*! Galois/Counter Mode (GCM) with GHASH (H loaded Y0-encrypted
         *  calculated internally) */
        DL_AESADVHP_MODE_GCM_LOAD_HASH_KEY = ( AESADVHP_CTRL_GCM_LOAD_HASH_KEY ) | ( AESADVHP_CTRL_CTR_ENABLE ),
        /*! Galois/Counter Mode (GCM) with Autonomous GHASH (Both H and Y0-encrypted
         *  calculated internally) */
        DL_AESADVHP_MODE_GCM_AUTONOMOUS    = ( AESADVHP_CTRL_GCM_AUTONOMOUS ) | ( AESADVHP_CTRL_CTR_ENABLE ),
        /*! Galois/Counter Mode GHASH only. Direction must be Decrypt */
        DL_AESADVHP_MODE_GCM_GHASH_ONLY    = ( AESADVHP_CTRL_GCM_FORCE_ZERO ),
        /*! Cipher block chaining, message authentication code (CCM) mode */
        DL_AESADVHP_MODE_CCM               = ( AESADVHP_CTRL_CCM_ENABLE ) | ( AESADVHP_CTRL_CTR_ENABLE ),
    } DL_AESADVHP_MODE;

    /*! @enum DL_AESADVHP_KEY_SIZE */
    typedef enum
    {
        /*! 128-bit Key Size */
        DL_AESADVHP_KEY_SIZE_128_BIT = AESADVHP_CTRL_KEYSIZE_K128,
        /*! 256-bit Key Size */
        DL_AESADVHP_KEY_SIZE_256_BIT = AESADVHP_CTRL_KEYSIZE_K256,
    } DL_AESADVHP_KEY_SIZE;

    /*! @enum DL_AESADVHP_DIR */
    typedef enum
    {
        /*! Encryption */
        DL_AESADVHP_DIR_ENCRYPT = AESADVHP_CTRL_DIR_ENCRYPT,
        /*! Decryption */
        DL_AESADVHP_DIR_DECRYPT = AESADVHP_CTRL_DIR_DECRYPT,
    } DL_AESADVHP_DIR;

    /*! @enum DL_AESADVHP_CTR_WIDTH */
    typedef enum
    {
        /*! Counter (CTR) mode 32-bit counter */
        DL_AESADVHP_CTR_WIDTH_32_BIT  = AESADVHP_CTRL_CTR_WIDTH_CTR32,
        /*! Counter (CTR) mode 64-bit counter */
        DL_AESADVHP_CTR_WIDTH_64_BIT  = AESADVHP_CTRL_CTR_WIDTH_CTR64,
        /*! Counter (CTR) mode 96-bit counter */
        DL_AESADVHP_CTR_WIDTH_96_BIT  = AESADVHP_CTRL_CTR_WIDTH_CTR96,
        /*! Counter (CTR) mode 128-bit counter */
        DL_AESADVHP_CTR_WIDTH_128_BIT = AESADVHP_CTRL_CTR_WIDTH_CTR128,
    } DL_AESADVHP_CTR_WIDTH;

    /*! @enum DL_AESADVHP_FB_WIDTH */
    typedef enum
    {
        DL_AESADVHP_FB_WIDTH_128 = AESADVHP_CTRL_CTR_WIDTH_CFB128,
    } DL_AESADVHP_FB_WIDTH;

