TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_aesadvhp.h
    /*! @enum DL_AESADVHP_CCM_CTR_WIDTH */
    typedef enum
    {
        /*! Counter field width of 2 bytes (value of 1 stored in CCM-L) */
        DL_AESADVHP_CCM_CTR_WIDTH_2_BYTES = ( ( uint32_t ) 1U << AESADVHP_CTRL_CCML_OFS ),
        /*! Counter field width of 3 bytes (value of 2 stored in CCM-L) */
        DL_AESADVHP_CCM_CTR_WIDTH_3_BYTES = ( ( uint32_t ) 2 << AESADVHP_CTRL_CCML_OFS ),
        /*! Counter field width of 4 bytes (value of 3 stored in CCM-L) */
        DL_AESADVHP_CCM_CTR_WIDTH_4_BYTES = ( ( uint32_t ) 3 << AESADVHP_CTRL_CCML_OFS ),
        /*! Counter field width of 5 bytes (value of 4 stored in CCM-L) */
        DL_AESADVHP_CCM_CTR_WIDTH_5_BYTES = ( ( uint32_t ) 4 << AESADVHP_CTRL_CCML_OFS ),
        /*! Counter field width of 6 bytes (value of 5 stored in CCM-L) */
        DL_AESADVHP_CCM_CTR_WIDTH_6_BYTES = ( ( uint32_t ) 5 << AESADVHP_CTRL_CCML_OFS ),
        /*! Counter field width of 7 bytes (value of 6 stored in CCM-L) */
        DL_AESADVHP_CCM_CTR_WIDTH_7_BYTES = ( ( uint32_t ) 6 << AESADVHP_CTRL_CCML_OFS ),
        /*! Counter field width of 8 bytes (value of 7 stored in CCM-L) */
        DL_AESADVHP_CCM_CTR_WIDTH_8_BYTES = ( ( uint32_t ) 7 << AESADVHP_CTRL_CCML_OFS ),
    } DL_AESADVHP_CCM_CTR_WIDTH;

    /*! @enum DL_AESADVHP_CCM_TAG_WIDTH */
    typedef enum
    {
        /*! Authentication field width of 1 byte  (value of 0 stored in CCM-M) */
        DL_AESADVHP_CCM_TAG_WIDTH_1_BYTE  = ( ( uint32_t ) 0 << AESADVHP_CTRL_CCMM_OFS ),
        /*! Authentication field width of 2 bytes (value of 1 stored in CCM-M) */
        DL_AESADVHP_CCM_TAG_WIDTH_2_BYTES = ( ( uint32_t ) 1 << AESADVHP_CTRL_CCMM_OFS ),
        /*! Authentication field width of 3 bytes (value of 2 stored in CCM-M) */
        DL_AESADVHP_CCM_TAG_WIDTH_3_BYTES = ( ( uint32_t ) 2 << AESADVHP_CTRL_CCMM_OFS ),
        /*! Authentication field width of 4 bytes (value of 3 stored in CCM-M) */
        DL_AESADVHP_CCM_TAG_WIDTH_4_BYTES = ( ( uint32_t ) 3 << AESADVHP_CTRL_CCMM_OFS ),
        /*! Authentication field width of 5 bytes (value of 4 stored in CCM-M) */
        DL_AESADVHP_CCM_TAG_WIDTH_5_BYTES = ( ( uint32_t ) 4 << AESADVHP_CTRL_CCMM_OFS ),
        /*! Authentication field width of 6 bytes (value of 5 stored in CCM-M) */
        DL_AESADVHP_CCM_TAG_WIDTH_6_BYTES = ( ( uint32_t ) 5 << AESADVHP_CTRL_CCMM_OFS ),
        /*! Authentication field width of 7 bytes (value of 6 stored in CCM-M) */
        DL_AESADVHP_CCM_TAG_WIDTH_7_BYTES = ( ( uint32_t ) 6 << AESADVHP_CTRL_CCMM_OFS ),
        /*! Authentication field width of 8 bytes (value of 7 stored in CCM-M) */
        DL_AESADVHP_CCM_TAG_WIDTH_8_BYTES = ( ( uint32_t ) 7 << AESADVHP_CTRL_CCMM_OFS ),
    } DL_AESADVHP_CCM_TAG_WIDTH;

    /*! @enum DL_AESADVHP_STATUS */
    typedef enum
    {
        /*! Operation was successful */
        DL_AESADVHP_STATUS_SUCCESS,
        /*! Operation was not performed because address was unaligned */
        DL_AESADVHP_STATUS_UNALIGNED_ACCESS,
    } DL_AESADVHP_STATUS;

    /**
     *  @brief Configuration structure for the AESADVHP module. It contains the
     *         superset of configurable information for the control module.
     */
    typedef struct
    {
        /*! Mode field, one of @ref DL_AESADVHP_MODE */
        DL_AESADVHP_MODE          mode;
        /*! Encrypt or decrypt, one of @ref DL_AESADVHP_DIR. Note that CBCMAC cannot
         *  be configured with the decrypt direction */
        DL_AESADVHP_DIR           direction;
        /*! Counter mode (CTR) counter width, one of @ref DL_AESADVHP_CTR_WIDTH. CTR
         *  width is also used in combined operation modes CCM and GCM */
        DL_AESADVHP_CTR_WIDTH     ctr_ctrWidth;
        /*! Cipher Feedback (CFB) feedback width, one of @ref DL_AESADVHP_FB_WIDTH */
        DL_AESADVHP_FB_WIDTH      cfb_fbWidth;
        /*! CCM width of the counter length field for CCM operations, one of
         *  @ref DL_AESADVHP_CCM_CTR_WIDTH. The ctr_width parameter must be equal to
         *  or larger than this value */
        DL_AESADVHP_CCM_CTR_WIDTH ccm_ctrWidth;
        /*! CCM Width of the authentication field for CCM operations, one of
         *  @ref DL_AESADVHP_CCM_TAG_WIDTH */
        DL_AESADVHP_CCM_TAG_WIDTH ccm_tagWidth;
        /*! Initialization Vector. Should be 32-bit aligned */
        uint8_t                  *iv;
        /*! Nonce in the case of CCM, this should point to the nonce. Refer to
         *  @ref DL_AESADVHP_loadCCMNonceAndCounter in order to determine nonce length
         *  used  */
        uint8_t                  *nonce;
        /*! Derived key K1, used in the authentication-only mode CMAC
         *  Must be 32-bit aligned and equal to the block size (128-bits) */
        uint8_t                  *k1;
        /*! Derived key K2, used in the authentication-only mode CMAC
         *  must be 32-bit aligned and equal to the block size (128-bits) */
        uint8_t                  *k2;
        /*! Crypto Data Length - 61-bit value expressed as an upper value and lower
         *  value. This is the lower 32-bits */
        uint32_t                  lowerCryptoLength;
        /*! Crypto Data Length - 61-bit value expressed as an upper value and lower
         *  value. This is the upper 29-bits */
        uint32_t                  upperCryptoLength;
        /*! Additional Authentication Data (AAD) Length. CCM/GCM specific */
        uint32_t                  aadLength;
    } DL_AESADVHP_Config;

    /**
     * @brief Enables the Peripheral Write Enable (PWREN) register for the AESADV
     *
     *  Before any peripheral registers can be configured by software, the
     *  peripheral itself must be enabled by writing the ENABLE bit together with
     *  the appropriate KEY value to the peripheral's PWREN register.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     */
    __STATIC_INLINE void DL_AESADVHP_enablePower( AESADVHP_Regs *aesadv )
    {
        aesadv->GPRCM.PWREN = ( AESADVHP_PWREN_KEY_UNLOCK_W | AESADVHP_PWREN_ENABLE_ENABLE );
    }

    /**
     * @brief Disables the Peripheral Write Enable (PWREN) register for the AESADVHP
     *
     *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
     *  accessible for read/write operations.
     *
     *  @note This API does not provide large power savings
     *
     *  @param[in] aesadv        Pointer to the register overlay for the peripheral
     */
    __STATIC_INLINE void DL_AESADVHP_disablePower( AESADVHP_Regs *aesadv )
    {
        aesadv->GPRCM.PWREN = ( AESADVHP_PWREN_KEY_UNLOCK_W | AESADVHP_PWREN_ENABLE_DISABLE );
    }

    /**
     * @brief Returns if the Peripheral Write Enable (PWREN) register for the AESADVHP
     *        is enabled
     *
     *  Before any peripheral registers can be configured by software, the
     *  peripheral itself must be enabled by writing the ENABLE bit together with
     *  the appropriate KEY value to the peripheral's PWREN register.
     *
     *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
     *  accessible for read/write operations.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     * @return true if peripheral register access is enabled
     * @return false if peripheral register access is disabled
     */
    __STATIC_INLINE bool DL_AESADVHP_isPowerEnabled( AESADVHP_Regs *aesadv )
    {
        return ( ( aesadv->GPRCM.PWREN & AESADVHP_PWREN_ENABLE_MASK ) == AESADVHP_PWREN_ENABLE_ENABLE );
    }

    /**
     *  @brief Resets AESADVHP module
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     */
    __STATIC_INLINE void DL_AESADVHP_reset( AESADVHP_Regs *aesadv )
    {
        aesadv->GPRCM.RSTCTL =
            ( AESADVHP_RSTCTL_KEY_UNLOCK_W | AESADVHP_RSTCTL_RESETSTKYCLR_CLR | AESADVHP_RSTCTL_RESETASSERT_ASSERT );
    }

    /**
     *  @brief Returns if AESADVHP module was reset
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @retval true   Peripheral was reset
     *  @retval false  Peripheral wasn't reset
     */
    __STATIC_INLINE bool DL_AESADVHP_isReset( const AESADVHP_Regs *aesadv )
    {
        return ( ( aesadv->GPRCM.STAT & AESADVHP_STAT_RESETSTKY_MASK ) == AESADVHP_STAT_RESETSTKY_RESET );
    }

    /**
     *  @brief Returns if an AES output block is available to be read
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @retval true   AES output block is available
     *  @retval false  No AES output block is available
     */
    __STATIC_INLINE bool DL_AESADVHP_isOutputReady( const AESADVHP_Regs *aesadv )
    {
        return ( ( aesadv->CTRL & AESADVHP_CTRL_OUTPUT_RDY_MASK ) == AESADVHP_CTRL_OUTPUT_RDY_READY );
    }

    /**
     *  @brief Returns if the input buffer is empty, and more data can be written
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @retval true   Input buffer is empty
     *  @retval false  Input buffer is not empty
     */
    __STATIC_INLINE bool DL_AESADVHP_isInputReady( const AESADVHP_Regs *aesadv )
    {
        return ( ( aesadv->CTRL & AESADVHP_CTRL_INPUT_RDY_MASK ) == AESADVHP_CTRL_INPUT_RDY_EMPTY );
    }

    /**
     *  @brief Sets the direction of the engine (encrypt/decrypt)
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] direction    Direction. One of @ref DL_AESADVHP_DIR.
     *
     *  @note CBC-MAC must be configured as encrypt (@ref DL_AESADVHP_DIR_ENCRYPT).
     */
    __STATIC_INLINE void DL_AESADVHP_setDirection( AESADVHP_Regs *aesadv, DL_AESADVHP_DIR direction )
    {
        DL_Common_updateReg( &aesadv->CTRL, ( uint32_t ) direction, AESADVHP_CTRL_DIR_MASK );
    }

    /**
     *  @brief Returns the direction of the AESADVHP peripheral (encrypt/decrypt)
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @return one of @ref DL_AESADVHP_DIR
     */
    __STATIC_INLINE DL_AESADVHP_DIR DL_AESADVHP_getDirection( const AESADVHP_Regs *aesadv )
    {
        uint32_t direction = ( aesadv->CTRL & AESADVHP_CTRL_DIR_MASK );

        return ( DL_AESADVHP_DIR ) ( direction );
    }

    /**
     *  @brief Sets the key size of the AESADVHP peripheral
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] size         Key Size. One of @ref DL_AESADVHP_KEY_SIZE.
     */
    __STATIC_INLINE void DL_AESADVHP_setKeySize( AESADVHP_Regs *aesadv, DL_AESADVHP_KEY_SIZE size )
    {
        DL_Common_updateReg( &aesadv->CTRL, ( uint32_t ) size, AESADVHP_CTRL_KEYSIZE_MASK );
    }

    /**
     *  @brief Returns the current key size of the AESADVHP peripheral
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @return one of @ref DL_AESADVHP_KEY_SIZE.
     */
    __STATIC_INLINE DL_AESADVHP_KEY_SIZE DL_AESADVHP_getKeySize( const AESADVHP_Regs *aesadv )
    {
        uint32_t keySize = ( aesadv->CTRL & AESADVHP_CTRL_KEYSIZE_MASK );

