TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_aesadvhp.h
        return ( DL_AESADVHP_KEY_SIZE ) ( keySize );
    }

    /**
     *  @brief Sets the AES algorithm mode
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] mode         Algorithm Mode. One of @ref DL_AESADVHP_MODE.
     *
     *  @note Selecting GCM as a mode requires an additional selection of the GHASH
     *        parameters expected. Please refer to the TRM for more information.
     *  @note Due to the dual use of the OFB/gcm_ccm_continue_aad bit field, if the
     *        resumption of the AAD phase of a GCM/CCM operation is desired, it must
     *        be set with the mode using @ref DL_AESADVHP_resumeAADPhase, for the bit
     *        will be cleared in this function
     *
     *  @sa   DL_AESADVHP_resumeAADPhase
     */
    __STATIC_INLINE void DL_AESADVHP_setMode( AESADVHP_Regs *aesadv, DL_AESADVHP_MODE mode )
    {
        DL_Common_updateReg( &aesadv->CTRL, ( uint32_t ) mode, ( uint32_t ) DL_AESADVHP_MODE_MASK );
    }

    /**
     *  @brief Returns the current selected mode
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @return one of @ref DL_AESADVHP_MODE.
     *
     *  @note upon resumption of a AAD phase of operation, the dual-purpose
     *        bit of continue AAD/OFB will be read as one. In this case, the mode
     *        must be set again for a valid value to be read.
     *
     *  @sa DL_AESADVHP_setMode
     */
    __STATIC_INLINE DL_AESADVHP_MODE DL_AESADVHP_getMode( const AESADVHP_Regs *aesadv )
    {
        uint32_t mode = ( aesadv->CTRL & DL_AESADVHP_MODE_MASK );
        return ( DL_AESADVHP_MODE ) ( mode );
    }

    /**
     *  @brief Sets the feedback width of the AESADVHP peripheral
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] fbWidth      Feedback Width. One of @ref DL_AESADVHP_FB_WIDTH.
     *
     *  @note this is only applicable in cipher feeback mode (CFB). OFB always has
     *        width 128.
     */
    __STATIC_INLINE void DL_AESADVHP_setFeedbackWidth( AESADVHP_Regs *aesadv, DL_AESADVHP_FB_WIDTH fbWidth )
    {
        DL_Common_updateReg( &aesadv->CTRL, ( uint32_t ) fbWidth, AESADVHP_CTRL_CTR_WIDTH_MASK );
    }

    /**
     *  @brief Returns the current feedback width
     *
     *  @param[in] aesadv        Pointer to the register overlay for the peripheral
     *
     *  @return one of @ref DL_AESADVHP_FB_WIDTH.
     *
     *  @sa DL_AESADVHP_setFeedbackWidth
     */
    __STATIC_INLINE DL_AESADVHP_FB_WIDTH DL_AESADVHP_getFeedbackWidth( const AESADVHP_Regs *aesadv )
    {
        uint32_t fbWidth = ( aesadv->CTRL & AESADVHP_CTRL_CTR_WIDTH_MASK );

        return ( DL_AESADVHP_FB_WIDTH ) ( fbWidth );
    }

    /**
     *  @brief Sets the counter width of the AESADVHP peripheral
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] ctrWidth     Counter Width. One of @ref DL_AESADVHP_CTR_WIDTH.
     *
     *  @note this is only applicable in modes CTR, CCM
     *  @note GCM restricts counter width to 32-bits, which is not required to be
     *        set.
     *  @note if using CCM, the counter width must be wide enough to accommodate the
     *        chosen CCM length, one of @ref DL_AESADVHP_CCM_CTR_WIDTH (in bytes)
     *
     *  @sa DL_AESADVHP_setCCMCounterWidth
     */
    __STATIC_INLINE void DL_AESADVHP_setCounterWidth( AESADVHP_Regs *aesadv, DL_AESADVHP_CTR_WIDTH ctrWidth )
    {
        DL_Common_updateReg( &aesadv->CTRL, ( uint32_t ) ctrWidth, AESADVHP_CTRL_CTR_WIDTH_MASK );
    }

    /**
     *  @brief Returns the current counter width
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @return one of @ref DL_AESADVHP_CTR_WIDTH.
     *
     *  @sa DL_AESADVHP_setCounterWidth
     */
    __STATIC_INLINE DL_AESADVHP_CTR_WIDTH DL_AESADVHP_getCounterWidth( const AESADVHP_Regs *aesadv )
    {
        uint32_t ctrWidth = ( aesadv->CTRL & AESADVHP_CTRL_CTR_WIDTH_MASK );

        return ( DL_AESADVHP_CTR_WIDTH ) ( ctrWidth );
    }

    /**
     *  @brief Sets the CCM counter width of the AESADVHP peripheral
     *
     *  Counter with CBC-MAC (CCM) Specific. Sets the width of the counter field
     *  that is loaded into the initialization vector along with the nonce. This
     *  signal is sometimes referred to as CCM-L. The nonce can be calculated via
     *  the following table:
     *
     *  DL_AESADVHP_CCM_CTR_WIDTH (bytes) | Nonce Array Length Required (bytes)
     *  --------------------------------|-------------------------------------
     *              2                   |                13
     *              3                   |                12
     *              4                   |                11
     *              5                   |                10
     *              6                   |                 9
     *              7                   |                 8
     *              8                   |                 7
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] ccm_ctrWidth Counter Width. One of @ref DL_AESADVHP_CCM_CTR_WIDTH
     *
     *  @note this is only applicable in modes CCM
     *  @note The general counter width must be wide enough to accommodate the
     *        chosen CCM counter width, one of @ref DL_AESADVHP_CTR_WIDTH (in bits). A
     *        counter width of 64-bits is sufficient to cover all cases.
     *
     *  @sa DL_AESADVHP_setCounterWidth
     *  @sa DL_AESADVHP_loadCCMNonceAndCounter
     */
    __STATIC_INLINE void DL_AESADVHP_setCCMCounterWidth( AESADVHP_Regs *aesadv, DL_AESADVHP_CCM_CTR_WIDTH ccm_ctrWidth )
    {
        DL_Common_updateReg( &aesadv->CTRL, ( uint32_t ) ccm_ctrWidth, AESADVHP_CTRL_CCML_MASK );
    }

    /**
     *  @brief Returns the current CCM-specific counter width
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @return one of @ref DL_AESADVHP_CCM_CTR_WIDTH.
     *
     *  @sa DL_AESADVHP_setCCMCounterWidth
     */
    __STATIC_INLINE DL_AESADVHP_CCM_CTR_WIDTH DL_AESADVHP_getCCMCounterWidth( const AESADVHP_Regs *aesadv )
    {
        uint32_t ccm_ctrWidth = ( aesadv->CTRL & AESADVHP_CTRL_CCML_MASK );

