TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_aesadvhp.h
        return ( DL_AESADVHP_CCM_CTR_WIDTH ) ( ccm_ctrWidth );
    }

    /**
     *  @brief Sets the CCM authentication tag width of the AESADVHP peripheral
     *
     *  Counter with CBC-MAC (CCM) Specific. Sets the width of the authentication
     *  field that is retrieved upon completion of the operation. The first bytes
     *  of the calculated tag will be returned, and the rest of the tag ignored.
     *  This signal is sometimes referred to as CCM-M.
     *      The full-width tag will still be calculated, just the least-significant
     *  bits will be used as according to this setting.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] ccm_tagWidth Tag Width. One of @ref DL_AESADVHP_CCM_TAG_WIDTH.
     */
    __STATIC_INLINE void DL_AESADVHP_setCCMTagWidth( AESADVHP_Regs *aesadv, DL_AESADVHP_CCM_TAG_WIDTH ccm_tagWidth )
    {
        DL_Common_updateReg( &aesadv->CTRL, ( uint32_t ) ccm_tagWidth, AESADVHP_CTRL_CCMM_MASK );
    }

    /**
     *  @brief Returns the current CCM-specific authentication tag width
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @return one of @ref DL_AESADVHP_CCM_TAG_WIDTH.
     *
     *  @sa DL_AESADVHP_setCCMTagWidth
     */
    __STATIC_INLINE DL_AESADVHP_CCM_TAG_WIDTH DL_AESADVHP_getCCMTagWidth( const AESADVHP_Regs *aesadv )
    {
        uint32_t ccm_tagWidth = ( aesadv->CTRL & AESADVHP_CTRL_CCMM_MASK );

        return ( DL_AESADVHP_CCM_TAG_WIDTH ) ( ccm_tagWidth );
    }

    /**
     *  @brief  Halt operation and generate intermediate Digest for CCM/GCM
     *
     *  Specific to a multi-block CCM/GCM mode. This will interrupt processing at
     *  the boundary of a full AES block (128-bits or 16 bytes) and prepare an
     *  intermediate digest that can be used to resume operations.
     *      If the user is still inputting additional authentication data (AAD), the
     *  operation shall be resumed in the AAD phase. If the user is inputting
     *  payload data (ciphertext/plaintext), the operation shall be resumed in the
     *  data phase.
     *      The user is responsible for reading and saving the intermediate digest
     *  to preserve the state for a future resumption of the Operation.
     *      The user must have at least 1 or more bytes of additional information
     *  that needs to be inputted in order for a halt to occur.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     */
    __STATIC_INLINE void DL_AESADVHP_haltOperationAndGenerateDigest( AESADVHP_Regs *aesadv )
    {
        aesadv->CTRL |= AESADVHP_CTRL_GET_DIGEST_ENABLE;
    }

    /**
     *  @brief Resume GCM or CCM operation in the AAD phase
     *
     *  Specific to a multi-block CCM/GCM mode that contains Additional
     *  Authentication Data to be written after an operation has been halted. This
     *  operation should be performed last, after the entire digest for the example
     *  has been added. The mode is written in conjunction with the resumption
     *  signal, so it must be provided.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] mode         A supported GCM or CCM mode from @ref DL_AESADVHP_MODE
     *
     *  @sa DL_AESADVHP_haltOperationAndReturnDigest
     *  @sa DL_AESADVHP_resumeDataPhase
     */
    __STATIC_INLINE void DL_AESADVHP_resumeAADPhase( AESADVHP_Regs *aesadv, DL_AESADVHP_MODE mode )
    {
        DL_Common_updateReg(
            &aesadv->CTRL, ( ( ( uint32_t ) mode ) | ( ( uint32_t ) AESADVHP_CTRL_OFB_GCM_CCM_CONT_GCM_CCM_CONTINUE ) ),
            ( DL_AESADVHP_MODE_MASK | AESADVHP_CTRL_OFB_GCM_CCM_CONT_MASK ) );
    }

    /**
     *  @brief Resume GCM or CCM operation in the Data phase
     *
     *  Specific to a multi-block CCM/GCM mode that contains additional Payload Data
     *  (ciphertext/plaintext) to be written after an operation has been halted, and
     *  any and all AAD has already been written before the time of halting. This
     *  operation should be performed last, after the entire digest for the example
     *  has been added. The mode is written in conjunction with the resumption
     *  signal, so it must be provided.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] mode         A supported GCM or CCM mode from @ref DL_AESADVHP_MODE
     *
     *  @sa DL_AESADVHP_haltOperationAndReturnDigest
     *  @sa DL_AESADVHP_resumeAADPhase
     */
    __STATIC_INLINE void DL_AESADVHP_resumeDataPhase( AESADVHP_Regs *aesadv, DL_AESADVHP_MODE mode )
    {
        DL_Common_updateReg( &aesadv->CTRL, ( ( uint32_t ) mode | AESADVHP_CTRL_GCM_CONT_ENABLE ),
                             ( ( uint32_t ) DL_AESADVHP_MODE_MASK | AESADVHP_CTRL_GCM_CONT_MASK ) );
    }

    /**
     *  @brief Enables the storage and return of a tag or result IV
     *
     *  Set if a given configuration must require an authentication TAG or result IV
     *  to be stored as part of the result context. This will trigger the context
     *  output DMA or interrupt assertion after operation completion. Additionally,
     *  the saved context ready will now be set high. Th engine will retain the
     *  registers until they have been read. Only after an associated TAG/IV has
     *  been read will a new DMA request for an input context be sent.
     *      Typically, this is set when methods return a TAG (GCM, CCM, CBCMAC) or
     *  in case an IV is to be returned for a future continued operation (CBC, CTR,
     *  etc.).
     *      If not set, the engine will assert a DMA request with the current
     *  context.
     *
     * @param[in] aesadv       Pointer to the register overlay for the peripheral
     */
    __STATIC_INLINE void DL_AESADVHP_enableSavedOutputContext( AESADVHP_Regs *aesadv )
    {
        aesadv->CTRL |= AESADVHP_CTRL_SAVE_CNTXT_ENABLE;
    }

    /**
     *  @brief Disables the storage and return of a tag or result IV
     *
     *  Set if a given configuration must require an authentication TAG or result IV
     *  to be stored as part of the result context. This will trigger the context
     *  output DMA or interrupt assertion after operation completion. Additionally,
     *  the saved context ready will now be set high. Th engine will retain the
     *  registers until they have been read.
     *      Typically, this is set when methods return a TAG (GCM, CCM, CBCMAC) or
     *  in case an IV is to be returned for a future continued operation (CBC, CTR,
     *  etc.).
     *      If not set, the engine will assert a DMA request with the current
     *  context.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     */
    __STATIC_INLINE void DL_AESADVHP_disableSavedOutputContext( AESADVHP_Regs *aesadv )
    {
        aesadv->CTRL &= ~( AESADVHP_CTRL_SAVE_CNTXT_ENABLE );
    }

    /**
     *  @brief Returns whether the storage of additional context is enabled
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @retval true   Saved Output Context is enabled.
     *  @retval false  Saved Output Context is disabled.
     *
     *  @sa DL_AESADVHP_enableSavedOutputContext
     */
    __STATIC_INLINE bool DL_AESADVHP_isSavedOutputContextEnabled( const AESADVHP_Regs *aesadv )
    {
        return ( ( aesadv->CTRL & AESADVHP_CTRL_SAVE_CNTXT_MASK ) == AESADVHP_CTRL_SAVE_CNTXT_ENABLE );
    }

    /**
     *  @brief Returns whether additional output context is available to be read
     *
     *  At the end of an operation, if additional result information to the
     *  ciphertext/plaintext is available such as TAG/IV(s), this will return true.
     *  If this value is high, then the context cannot be written.
     *
     *  @param[in] aesadv        Pointer to the register overlay for the peripheral
     *
     *  @retval true   Saved Output Context is ready to be retrieved.
     *  @retval false  Saved Output Context is unavailable.
     *
     *  @sa DL_AESADVHP_enableSavedOutputContext
     */
    __STATIC_INLINE bool DL_AESADVHP_isSavedOutputContextReady( const AESADVHP_Regs *aesadv )
    {
        return ( ( aesadv->CTRL & AESADVHP_CTRL_SAVED_CNTXT_RDY_MASK ) == AESADVHP_CTRL_SAVED_CNTXT_RDY_READY );
    }

    /**
     *  @brief Returns whether the input context can be written by the application.
     *
     *  Determines if the context (mode, IV, key, etc.) can be modified from its
     *  current state in the application by reading the CNTXT_RDY bit. This does not
     *  mean that a previous operation has necessarily finished, just that a new
     *  context may be written. Writing a new context before completion of the
     *  current context will cancel the current operation.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @retval true   Context can be safely written to by the application
     *  @retval false  Context cannot be written, AES Authentication TAGs or IV's
     *                 are available and must be read before context can be
     *                 interrupted
     */
    __STATIC_INLINE bool DL_AESADVHP_isInputContextWriteable( const AESADVHP_Regs *aesadv )
    {
        return ( ( aesadv->CTRL & AESADVHP_CTRL_CNTXT_RDY_MASK ) == AESADVHP_CTRL_CNTXT_RDY_READY );
    }

    /**
     *  @brief Sets the lower 32 bits of the crypto input data length in bytes
     *
     *  The entire length of crypto input data that can be provided is 61-bits long,
     *  and is thus set in two separate functions. The lower 32-bits will be set and
     *  decremented as the operation continues.
     *      Setting the crypto length to 0 for basic modes (CBC, CTR, ICM, CFB, OFB)
     *  will configure the AESADVHP module to expect an infinite input stream for the
     *  device.
     *      For GCM and CCM, this mode does not include Additional Authentication
     *  Data, this is set separately. If there is a positive AAD length, it is not
     *  required for this register to have a nonzero value.
     *      Reads from this register return all zeros, so reads are not necessary.
     *      For modes that do not allow partial blocks such as CBC, this number must
     *   be a multiple of 16.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] lowerLength  Lower 32-bits of crypto data length that will be
     *                          inputted
     *
     *  @note This sets the context for the register, and thus should be called last
     *        in the configuration for non-combined modes
     *
     *  @sa DL_AESADVHP_setUpperCryptoLength
     *  @sa DL_AESADVHP_setAADLength
     */
    __STATIC_INLINE void DL_AESADVHP_setLowerCryptoLength( AESADVHP_Regs *aesadv, uint32_t lowerLength )
    {
        aesadv->C_LENGTH_0 = lowerLength;
    }

    /**
     *  @brief Sets the upper 29 bits of the crypto input data length in bytes
     *
     *  The entire length of crypto input data that can be provided is 61-bits long,
     *  and is thus set in two separate functions. The upper 29-bits will be set in
     *  this function should a length larger than or equal to 2^32 be necessary.
     *  Bits 29-31 are to be zeroed out upon a write.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] upperLength  Upper 29 bits of the crypto data length in bytes
     *                          that will be inputted
     *
     *  @note This sets the context for the register in combined modes (GCM/CCM),
     *        and thus should be called last in the configuration
     *
     *  @sa DL_AESADVHP_setLowerCryptoLength
     */
    __STATIC_INLINE void DL_AESADVHP_setUpperCryptoLength( AESADVHP_Regs *aesadv, uint32_t upperLength )
    {
        aesadv->C_LENGTH_1 = upperLength & 0x1FFFFFFFU;
    }

    /**
     *  @brief Sets the length of additional authentication data (AAD)
     *
     *  Specific to CCM/GCM modes. Sets length of AAD for these modes and 0
     *  otherwise. Can be zero if no AAD, or can be nonzero with a zero crypto
     *  length for authentication-only operation. A write to this register triggers
     *  the engine to start the context, and should be written after Crypto Length.
     *      For GCM this can be any value < 2^32, for CCM this value must be less
     *  than 2^16 - 2^8.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] aadLength    length of AAD in bytes.
     *
     *  @sa DL_AESADVHP_setLowerLength
     */
    __STATIC_INLINE void DL_AESADVHP_setAADLength( AESADVHP_Regs *aesadv, uint32_t aadLength )
    {
        aesadv->AAD_LENGTH = aadLength;
    }

    /**
     *  @brief Enables DMA Operation for the AESADVHP module
     *
     *  Sets the AESADVHP module to run with Data Inputs using the DMA to read/write
     *  data rather than using register input/output
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @sa DL_AESADVHP_disableDMAOperation
     */
    __STATIC_INLINE void DL_AESADVHP_enableDMAOperation( AESADVHP_Regs *aesadv )
    {
        aesadv->DMA_HS = ( AESADVHP_DMA_HS_DMA_DATA_ACK_DMA_ENABLE );
    }

    /**
     *  @brief Disables DMA Operation for the AESADVHP module
     *
     *  Default behavior. Sets the AESADVHP module to run using register input output
     *  with data provided by the CPU rather than using the DMA
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     */
    __STATIC_INLINE void DL_AESADVHP_disableDMAOperation( AESADVHP_Regs *aesadv )
    {
        aesadv->DMA_HS = ( AESADVHP_DMA_HS_DMA_DATA_ACK_DMA_DISABLE );
    }

    /**
     *  @brief Returns if DMA Operation is enabled
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @retval true   Configured to read/write data using the DMA
     *  @retval false  Configured to read/write data using the CPU (Default)
     */
    __STATIC_INLINE bool DL_AESADVHP_isDMAOperationEnabled( const AESADVHP_Regs *aesadv )
    {
        return ( ( aesadv->DMA_HS & AESADVHP_DMA_HS_DMA_DATA_ACK_MASK ) == AESADVHP_DMA_HS_DMA_DATA_ACK_DMA_ENABLE );
    }

    /**
     *  @brief Returns if User Writes to the Key Registers on the AESADVHP are allowed
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @retval true   User Writes to the Key Registers are allowed
     *  @retval false  The user cannot write to the Key Registers
     *
     *  @note If user key writes are disabled but desired, a module reset is
     *        required
     */
    __STATIC_INLINE bool DL_AESADVHP_isUserKeyWriteEnabled( const AESADVHP_Regs *aesadv )
    {
        return ( ( aesadv->STATUS & AESADVHP_STATUS_KEYWR_MASK ) == AESADVHP_STATUS_KEYWR_ENABLED );
    }

    /**
     *  @brief Loads a 128 or 256 bit regular key to the AESADVHP module
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] key          Pointer to an uint8_t array with a length that
     *                          contains the cipher key
     *  @param[in] keySize      Key Size. One of @ref DL_AESADVHP_KEY_SIZE
     *
     *  @return Status of operation. Operation will fail if not 32-bit aligned. One
     *          of @ref DL_AESADVHP_STATUS.
     *
     *  @note This function adds additional cycles in order to verify no unaligned
     *        access, if this is not necessary, consider using uint32_t pointers and
     *        @ref DL_AESADVHP_setKeyAligned
     */
    DL_AESADVHP_STATUS DL_AESADVHP_setKey( AESADVHP_Regs *aesadv, const uint8_t *key, DL_AESADVHP_KEY_SIZE keySize );

    /**
     *  @brief Loads a 128 or 256 bit regular key to the AESADVHP module
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] keyAligned   Pointer to an uint32_t array with a length that
     *                          contains the cipher key
     *  @param[in] keySize      Key Size. One of @ref DL_AESADVHP_KEY_SIZE
     *
     *  @sa DL_AESADVHP_setKey
     */
    void DL_AESADVHP_setKeyAligned( AESADVHP_Regs *aesadv, const uint32_t *keyAligned, DL_AESADVHP_KEY_SIZE keySize );

    /**
     *  @brief set the hash key
     *
     *  GCM-Specific. Sets the GHASH Hash key (sometimes referred to as H) if in
     *  a GCM mode other than DL_AESADVHP_MODE_GCM_AUTONOMOUS.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] hashKey      Pointer to an uint8_t array of length 16 that
     *                          contains the hash key
     *
     *  @return Status of operation. Operation will fail if not 32-bit aligned. One
     *          of @ref DL_AESADVHP_STATUS.
     *
     *  @note This function adds additional cycles in order to verify no unaligned
     *        access, if this is not necessary, consider using uint32_t pointers and
     *        @ref DL_AESADVHP_setGCMHashKeyAligned
     */
    DL_AESADVHP_STATUS DL_AESADVHP_setGCMHashKey( AESADVHP_Regs *aesadv, const uint8_t *hashKey );

    /**
     *  @brief set the hash key
     *
     *  GCM-Specific. Sets the GHASH Hash key (sometimes referred to as H) if in
     *  a GCM mode other than DL_AESADVHP_MODE_GCM_AUTONOMOUS.
     *
     *  @param[in] aesadv         Pointer to the register overlay for the peripheral
     *  @param[in] hashKeyAligned Pointer to an uint32_t array of length 4 that
     *                            contains the hash key
     *
     *  @sa DL_AESADVHP_setGCMHashKey
     *
     */
    void DL_AESADVHP_setGCMHashKeyAligned( AESADVHP_Regs *aesadv, const uint32_t *hashKeyAligned );

    /**
     *  @brief Loads the CBC-MAC second key
     *
     *  Specific to CBC-MAC operation.  Pre-calculated second key to perform a
     *  final XOR operation on the last input data block.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] secondKey    Pointer to an uint8_t array of length 16 containing
     *                          the second key
     *
     *  @return Status of operation. Operation will fail if not 32-bit aligned. One
     *          of @ref DL_AESADVHP_STATUS.
     *
     *  @note This function adds additional cycles in order to verify no unaligned
     *        access, if this is not necessary, consider using uint32_t pointers and
     *        @ref DL_AESADVHP_setSecondKeyAligned
     */
    DL_AESADVHP_STATUS DL_AESADVHP_setSecondKey( AESADVHP_Regs *aesadv, const uint8_t *secondKey );

    /**
     *  @brief Loads the CBC-MAC second key
     *
     *  Specific to CBC-MAC operation.  Pre-calculated second key to perform a
     *  final XOR operation on the last input data block.
     *
     *  @param[in] aesadv            Pointer to the register overlay for the
     *                               peripheral
     *  @param[in] secondKeyAligned  Pointer to an uint32_t array of length 4
     *                               containing the second key
     *
     *  @sa DL_AESADVHP_setSecondKey
     */
    void DL_AESADVHP_setSecondKeyAligned( AESADVHP_Regs *aesadv, const uint32_t *secondKeyAligned );

    /**
     *  @brief Loads the CBC-MAC third key
     *
     *  Specific to CBC-MAC operation. Pre-calculated third key to perform a
     *  final XOR operation on the last input data block.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] thirdKey     Pointer to an uint8_t array of length 16 containing
     *                          the third key
     *
     *  @return Status of operation. Operation will fail if not 32-bit aligned. One
     *          of @ref DL_AESADVHP_STATUS.
     *
     *  @note This function adds additional cycles in order to verify no unaligned
     *        access, if this is not necessary, consider using uint32_t pointers and
     *        @ref DL_AESADVHP_setThirdKeyAligned
     */
    DL_AESADVHP_STATUS DL_AESADVHP_setThirdKey( AESADVHP_Regs *aesadv, const uint8_t *thirdKey );

    /**
     *  @brief Loads the CBC-MAC third key
     *
     *  Specific to CBC-MAC operation. Pre-calculated third key to perform a
     *  final XOR operation on the last input data block.
     *
     *  @param[in] aesadv           Pointer to the register overlay for the
     *                              peripheral
     *  @param[in] thirdKeyAligned  Pointer to an uint32_t array of length 4
     *                              containing the third key
     *
     *  @sa DL_AESADVHP_setThirdKey
     */
    void DL_AESADVHP_setThirdKeyAligned( AESADVHP_Regs *aesadv, const uint32_t *thirdKeyAligned );

    /**
     *  @brief Loads either zero or an intermediate 128-bit TAG to resume GCM/CCM.
     *
     *  Specific to the GCM/CCM modes. During initialization and beginning of a new
     *  combined operation mode (GCM or CCM only), this must be set to 0. However,
     *  during continuation this tag is part of the saved intermediate digest that
     *  must be restored.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] tag          Pointer to an uint8_t array of length 16 containing
     *                          zeroes or the intermediate digest
     *
     *  @return Status of operation. Operation will fail if not 32-bit aligned. One
     *          of @ref DL_AESADVHP_STATUS.
     *
     *  @note This function adds additional cycles in order to verify no unaligned
     *        access, if this is not necessary, consider using uint32_t pointers and
     *        @ref DL_AESADVHP_loadIntermediateTAGAligned
     */
    DL_AESADVHP_STATUS DL_AESADVHP_loadIntermediateTAG( AESADVHP_Regs *aesadv, const uint8_t *tag );

    /**
     *  @brief Loads either zero or an intermediate 128-bit TAG to resume GCM/CCM.
     *
     *  Specific to the GCM/CCM modes. During initialization and beginning of a new
     *  combined operation mode (GCM or CCM only), this must be set to 0. However,
     *  during continuation this tag is part of the saved intermediate digest that
     *  must be restored.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] tagAligned   Pointer to an uint32_t array of length 4 containing
     *                          zeroes or the intermediate digest
     *
     *  @sa DL_AESADVHP_loadIntermediateTAG
     */
    void DL_AESADVHP_loadIntermediateTAGAligned( AESADVHP_Regs *aesadv, const uint32_t *tagAligned );

