TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_aesadvhp.h
    /**
     *  @brief Loads the 128-bit initialization vector to the AESADVHP module.
     *
     *  When used with GCM, the upper word iv[127:96] needs to be written with
     *  0x01000000 in order to appropriately mark the initial counter value of 1.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] iv           Pointer to an uint8_t array of length 16 containing
     *                          the initialization vector
     *
     *  @return Status of operation. Operation will fail if not 32-bit aligned. One
     *          of @ref DL_AESADVHP_STATUS.
     *
     *  @note  For CCM, this iv must be written with the CCM-specific value A0. This
     *         value consists of the concatenation of A0 flags, the nonce, and the
     *         counter. There is a specialized function that can load this type of
     *         IV found at @ref DL_AESADVHP_loadCCMNonceAndCounter.
     *
     *  @note This function adds additional cycles in order to verify no unaligned
     *        access, if this is not necessary, consider using uint32_t pointers and
     *        @ref DL_AESADVHP_loadInitializationVectorAligned
     *
     *  @sa DL_AESADVHP_loadCCMNonceAndCounter
     */
    DL_AESADVHP_STATUS DL_AESADVHP_loadInitializationVector( AESADVHP_Regs *aesadv, const uint8_t *iv );

    /**
     *  @brief Loads the 128-bit initialization vector to the AESADVHP module.
     *
     *  When used with GCM, the upper word iv[127:96] needs to be written with
     *  0x01000000 in order to appropriately mark the initial counter value of 1.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] ivAligned    Pointer to an uint32_t array of length 4 containing
     *                          the initialization vector
     *
     *  @note  For CCM, this iv must be written with the CCM-specific value A0. This
     *         value consists of the concatenation of A0 flags, the nonce, and the
     *         counter. There is a specialized function that can load this type of
     *         IV found at @ref DL_AESADVHP_loadCCMNonceAndCounter.
     *
     *  @sa DL_AESADVHP_loadCCMNonceAndCounter
     *  @sa DL_AESADVHP_loadInitializationVector
     */
    void DL_AESADVHP_loadInitializationVectorAligned( AESADVHP_Regs *aesadv, const uint32_t *ivAligned );

    /**
     *  @brief Reads the 128-bit initialization vector from the AES Module
     *
     *  Contains the latest 128-bit initialization vector output from the engine.
     *
     *  @param[in] aesadv        Pointer to the register overlay for the
     *                           peripheral
     *
     *  @param[out] iv           Pointer to an uint8_t array of length 16 where the
     *                           iv will be written
     *
     *  @return Status of operation. Operation will fail if not 32-bit aligned. One
     *          of @ref DL_AESADVHP_STATUS.
     *
     *  @note This function adds additional cycles in order to verify no unaligned
     *        access, if this is not necessary, consider using uint32_t pointers and
     *        @ref DL_AESADVHP_readInitializationVectorAligned
     */
    DL_AESADVHP_STATUS DL_AESADVHP_readInitializationVector( AESADVHP_Regs *aesadv, const uint8_t *iv );

    /**
     *  @brief Reads the 128-bit initialization vector from the AES Module
     *
     *  Contains the latest 128-bit initialization vector output from the engine.
     *
     *  @param[in] aesadv        Pointer to the register overlay for the
     *                           peripheral
     *
     *  @param[out] ivAligned    Pointer to an uint32_t array of length 4 where the
     *                           iv will be written
     *
     *  @sa DL_AESADVHP_readInitializationVector
     */
    void DL_AESADVHP_readInitializationVectorAligned( AESADVHP_Regs *aesadv, uint32_t *ivAligned );

    /**
     *  @brief Loads the CCM Nonce And Counter IV, also called A0
     *
     *  CCM-Specific use of the IV field called A0. The A0 field is formatted
     *  as follows:
     *
     *  LSB                                                                   MSB
     *  (5'b00000 concat 3'b counterWidth - 1) | Nonce | Counter IV (always 0's)
     *
     *  the counter width is set as one of DL_AESADVHP_CCM_CTR_WIDTH (equal to
     *  counterWidth -1).
     *      For example, a 5-byte width for the counter (and thus the data payload
     *  width) will correspond to a Counter IV of 40-bits. The counter width taking
     *  8 bits, and the Nonce taking the remaining 80-bits (10 bytes).
     *      An 8-byte counter width would yield a counter IV width of 64-bits with a
     *  Nonce taking the remaining 54-bits (7 bytes). The LSB of the IV will then
     *  be 8'b00000111 or 0x07 (one less than the byte width)
     *      Thus, the Nonce should be sufficiently wide to fit the bits that are
     *  remaining for the nonce, and this will vary with the counter field width
     *  provided. The LSB of the IV will be 0x04 (one less than the byte width)
     *
     *  The following table describes the Nonce array lengths that should be used:
     *
     *  DL_AESADVHP_CCM_CTR_WIDTH (bytes) | Nonce Array Length Required (bytes)
     *  --------------------------------|-------------------------------------
     *              2                   |                13
     *              3                   |                12
     *              4                   |                11
     *              5                   |                10
     *              6                   |                 9
     *              7                   |                 8
     *              8                   |                 7
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] nonce        Pointer to the uint8_t nonce Value for CCM, should
     *                          be unique and length calculated as above.
     *  @param[in] ctrWidth     Counter Width. One of @ref DL_AESADVHP_CCM_CTR_WIDTH.
     *                          Should match width provided in control register.
     *
     *  @note During halting and resumption of CCM operations, it is required to use
     *        the @ref DL_AESADVHP_loadInitializationVector and
     *        @ref DL_AESADVHP_readInitializationVector functions as this preserves
     *        the current counter state. This function is designed for
     *        initialization of the operation only.
     *
     *  @sa DL_AESADVHP_loadInitializationVector
     *  @sa DL_AESADVHP_readInitializationVector
     */
    void DL_AESADVHP_loadCCMNonceAndCounter( AESADVHP_Regs            *aesadv,
                                             uint8_t                  *nonce,
                                             DL_AESADVHP_CCM_CTR_WIDTH ctrWidth );

    /**
     *  @brief loads 128 bits (4 words) of input data
     *
     *  Loads the next 128 bits of input data. Either AAD (GCM/CCM) or Crypto Data.
     *  If less than 128 bits are left (or if the width of data is less than 128
     *  bits ex. CCM), it is still necessary to pad 0's to the remaining bits in
     *  order for the engine to start the operation.
     *      For GCM/CCM, the last AAD block can have less than 128 bits, and
     *  should be padded with 0's rather than appended to the crypto data.
     *      For authentication modes (GCM, CCM, CBC-MAC), refer to the TRM for
     *  additional information about necessary padding.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] data         Pointer to uint8_t bit data array of length 16 to
     *                          be inputted.
     *
     *  @return Status of operation. Operation will fail if not 32-bit aligned. One
     *          of @ref DL_AESADVHP_STATUS.
     *
     *  @note This function adds additional cycles in order to verify no unaligned
     *        access, if this is not necessary, consider using uint32_t pointers and
     *        @ref DL_AESADVHP_loadInputDataAligned
     *
     *  @sa DL_AESADVHP_readOutputData
     */
    DL_AESADVHP_STATUS DL_AESADVHP_loadInputData( AESADVHP_Regs *aesadv, const uint8_t *data );

    /**
     *  @brief loads 128 bits (4 words) of input data
     *
     *  Loads the next 128 bits of input data. Either AAD (GCM/CCM) or Crypto Data.
     *  If less than 128 bits are left (or if the width of data is less than 128
     *  bits ex. CCM), it is still necessary to pad 0's to the remaining bits in
     *  order for the engine to start the operation.
     *      For GCM/CCM, the last AAD block can have less than 128 bits, and
     *  should be padded with 0's rather than appended to the crypto data.
     *      For authentication modes (GCM, CCM, CBC-MAC), refer to the TRM for
     *  additional information about necessary padding.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] dataAligned  Pointer to uint32_t bit data array of length 4 to
     *                          be inputted.
     *
     *  @sa DL_AESADVHP_loadInputData
     *  @sa DL_AESADVHP_readOutputDataAligned
     */
    void DL_AESADVHP_loadInputDataAligned( AESADVHP_Regs *aesadv, const uint32_t *dataAligned );

    /**
     *  @brief reads 128-bits of output data that has been encrypted/decrypted.
     *
     *  Reads the ciphertext/plaintext outputted by the AESADVHP module. If less than
     *  128 bits is expected, there still must be 128-bits read, which must mean
     *  the data pointer has at least 128 bits to spare.
     *
     *  Inputting Additional Authentication Data (AAD) will not place any
     *  information into the output buffer, thus a read is not required.
     *
     *  @param[in] aesadv        Pointer to the register overlay for the peripheral
     *  @param[out] data         Pointer to the data that will be read, uint8_t
     *                           requiring length of at least 16 to not overwrite
     *                           other variables.
     *
     *  @return Status of operation. Operation will fail if not 32-bit aligned. One
     *          of @ref DL_AESADVHP_STATUS.
     *
     *  @note This function adds additional cycles in order to verify no unaligned
     *        access, if this is not necessary, consider using uint32_t pointers and
     *        @ref DL_AESADVHP_readOutputDataAligned
     */
    DL_AESADVHP_STATUS DL_AESADVHP_readOutputData( const AESADVHP_Regs *aesadv, const uint8_t *data );

    /**
     *  @brief reads 128-bits of output data that has been encrypted/decrypted.
     *
     *  Reads the ciphertext/plaintext outputted by the AESADVHP module. If less than
     *  128 bits is expected, there still must be 128-bits read, which must mean
     *  the data pointer has at least 128 bits to spare.
     *
     *  Inputting Additional Authentication Data (AAD) will not place any
     *  information into the output buffer, thus a read is not required.
     *
     *  @param[in] aesadv        Pointer to the register overlay for the peripheral
     *  @param[out] dataAligned  Pointer to the data that will be read, uint32_t
     *                           requiring length of at least 4 to not overwrite
     *                           other variables.
     *
     *  @sa DL_AESADVHP_readOutputData
     */
    void DL_AESADVHP_readOutputDataAligned( const AESADVHP_Regs *aesadv, uint32_t *dataAligned );

    /**
     *  @brief reads 128-bit output tag at the conclusion of operation/halt
     *
     *  Specific to authentication-enabled modes. Reads the tag. Only valid at the
     *  conclusion of an operation, or because an operation has been halted and
     *  requires a digest. In the case of a halted operation, the output will be
     *  an intermediate tag for CCM or GCM.
     *
     *  @param[in] aesadv        Pointer to the register overlay for the peripheral
     *  @param[out] tag          Pointer to the tag to be read, a uint8_t array of
     *                           length 16
     *
     *  @return Status of operation. Operation will fail if not 32-bit aligned. One
     *          of @ref DL_AESADVHP_STATUS.
     *
     *  @note This function adds additional cycles in order to verify no unaligned
     *        access, if this is not necessary, consider using uint32_t pointers and
     *        @ref DL_AESADVHP_readTAGAligned

