TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_aesadvhp.h
     *  @sa DL_AESADVHP_isSavedOutputContextReady
     */
    DL_AESADVHP_STATUS DL_AESADVHP_readTAG( const AESADVHP_Regs *aesadv, const uint8_t *tag );

    /**
     *  @brief reads 128-bit output tag at the conclusion of operation/halt
     *
     *  Specific to authentication-enabled modes. Reads the tag. Only valid at the
     *  conclusion of an operation, or because an operation has been halted and
     *  requires a digest. In the case of a halted operation, the output will be
     *  an intermediate tag for CCM or GCM.
     *
     *  @param[in] aesadv        Pointer to the register overlay for the peripheral
     *  @param[out] tagAligned   Pointer to the tag to be read, a uint32_t array of
     *                           length 4
     *
     *  @sa DL_AESADVHP_isSavedOutputContextReady
     */
    void DL_AESADVHP_readTAGAligned( const AESADVHP_Regs *aesadv, uint32_t *tagAligned );

/**
     *  @brief Forces AESADVHP to begin processing input data.
     *
     *  This function will validate the input data buffer and force AESADVHP to begin
     *  processing data. Any value can be used in order to force processing data.
     *
     *  @note To use, @ref DL_AESADVHP_enableDMAOperation must not be in use
     *
     *  @param[in] aesadv        Pointer to the register overlay for the peripheral
     */
    __STATIC_INLINE void DL_AESADVHP_forceInputDataAvailable( AESADVHP_Regs *aesadv )
    {
        aesadv->FORCE_IN_AV = 0x0123CAFEU;
    }

    /**
     *  @brief Set the CCM AAD align data word.
     *
     *  Specific to CCM mode. Writes the alignment data word used to concatenate to
     *  the next block of additional authentication data (AAD). Will need to be set
     *  during initialization or during the resumption of a halted CCM operation.
     *
     *  @param[in] aesadv        Pointer to the register overlay for the peripheral
     *  @param[in] alignWord     AAD alignment word of type uint32_t
     */
    __STATIC_INLINE void DL_AESADVHP_setCCMAlignWord( AESADVHP_Regs *aesadv, uint32_t alignWord )
    {
        aesadv->CCM_ALN_WRD = alignWord;
    }

    /**
     *  @brief Get the CCM AAD align data word.
     *
     *  Specific to CCM mode. Reads the alignment data word used to concatenate to
     *  the next block of additional authentication data (AAD).
     *
     *  @param[in] aesadv        Pointer to the register overlay for the peripheral
     *
     *  @return Current AAD alignment word of type uint32_t
     */
    __STATIC_INLINE uint32_t DL_AESADVHP_getCCMAlignWord( const AESADVHP_Regs *aesadv )
    {
        return ( aesadv->CCM_ALN_WRD );
    }

    /**
     *  @brief Sets the lower 32-bits of the data blocks remaining in an operation
     *
     *  Specific to GCM/CCM mode. The block count is 57-bits and represents the
     *  number of remaining AES cryptographic payload blocks (non-AAD) in an
     *  operation. During an interruption of a GCM/CCM operation, this number needs
     *  to be saved and restored before resumption.
     *
     *  @param[in] aesadv           Pointer to the register overlay for the
     *                              peripheral
     *  @param[in] lowerBlockCount  Lower 32-bits of the overall data blocks
     *                              remaining
     *
     *  @sa DL_AESADVHP_getLowerBlockCount
     *  @sa DL_AESADVHP_setUpperBlockCount
     */
    __STATIC_INLINE void DL_AESADVHP_setLowerBlockCount( AESADVHP_Regs *aesadv, uint32_t lowerBlockCount )
    {
        aesadv->BLK_CNT0 = lowerBlockCount;
    }

    /**
     *  @brief Gets the lower 32-bits of the data blocks remaining in an operation
     *
     *  Specific to GCM/CCM mode. The block count is 57-bits and represents the
     *  number of remaining AES cryptographic payload blocks (non-AAD) in an
     *  operation. During an interruption of a GCM/CCM operation, this number needs
     *  to be saved and restored before resumption.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @return Lower 32-bits of overall data blocks remaining
     *
     *  @sa DL_AESADVHP_setLowerBlockCount
     */
    __STATIC_INLINE uint32_t DL_AESADVHP_getLowerBlockCount( const AESADVHP_Regs *aesadv )
    {
        return aesadv->BLK_CNT0;
    }

    /**
     *  @brief Sets the upper 25-bits of the data blocks remaining in an operation
     *
     *  Specific to GCM/CCM mode. The block count is 57-bits and represents the
     *  number of remaining AES cryptographic payload blocks (non-AAD) in an
     *  operation. During an interruption of a GCM/CCM operation, this number needs
     *  to be saved and restored before resumption.
     *
     *  @param[in] aesadv           Pointer to the register overlay for the
     *                              peripheral
     *  @param[in] upperBlockCount  Upper 25-bits of the overall data blocks
     *                              remaining (bits [25:31] are ignored)
     *
     *  @sa DL_AESADVHP_getUpperBlockCount
     *  @sa DL_AESADVHP_setLowerBlockCount
     */
    __STATIC_INLINE void DL_AESADVHP_setUpperBlockCount( AESADVHP_Regs *aesadv, uint32_t upperBlockCount )
    {
        aesadv->BLK_CNT1 = ( upperBlockCount & 0x01FFFFFFU );
    }

    /**
     *  @brief Gets the upper 25-bits of the data blocks remaining in an operation
     *
     *  Specific to GCM/CCM mode. The block count is 57-bits and represents the
     *  number of remaining AES cryptographic payload blocks (non-AAD) in an
     *  operation. During an interruption of a GCM/CCM operation, this number needs
     *  to be saved and restored before resumption.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @return Upper 25-bits of overall data blocks remaining (bits [25:31] are 0)
     *
     *  @sa DL_AESADVHP_setUpperBlockCount
     */
    __STATIC_INLINE uint32_t DL_AESADVHP_getUpperBlockCount( const AESADVHP_Regs *aesadv )
    {
        return ( aesadv->BLK_CNT1 & 0x01FFFFFFU );
    }

    /**
     *  @brief      Enable AESADVHP interrupts
     *
     *  @param[in]  aesadv        Pointer to the register overlay for the peripheral
     *  @param[in]  interruptMask Bit mask of interrupts to enable. Bitwise OR of
     *                            @ref DL_AESADVHP_INTERRUPT
     */
    __STATIC_INLINE void DL_AESADVHP_enableInterrupt( AESADVHP_Regs *aesadv, uint32_t interruptMask )
    {
        aesadv->INT_EVENT0.IMASK |= interruptMask;
    }

    /**
     *  @brief      Disable AESADVHP interrupts
     *
     *  @param[in]  aesadv         Pointer to the register overlay for the
     *                             peripheral
     *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
     *                             @ref DL_AESADVHP_INTERRUPT
     */
    __STATIC_INLINE void DL_AESADVHP_disableInterrupt( AESADVHP_Regs *aesadv, uint32_t interruptMask )
    {
        aesadv->INT_EVENT0.IMASK &= ~( interruptMask );
    }

    /**
     *  @brief      Check if AES Ready interrupt is enabled
     *
     *  @param[in]  aesadv         Pointer to the register overlay for the
     *                             peripheral
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_AESADVHP_INTERRUPT
     *
     *  @return     Which of the requested AESADVHP interrupts are enabled
     *
     *  @retval     Bitwise OR of @ref DL_AESADVHP_INTERRUPT values
     */
    __STATIC_INLINE uint32_t DL_AESADVHP_getEnabledInterrupts( const AESADVHP_Regs *aesadv, uint32_t interruptMask )
    {
        return ( aesadv->INT_EVENT0.IMASK & interruptMask );
    }

    /**
     *  @brief      Check interrupt flag of enabled AESADVHP interrupts
     *
     *  Checks if any of the AESADVHP interrupts that was previously enabled are
     *  pending.
     *
     *  @param[in]  aesadv         Pointer to the register overlay for the
     *                             peripheral
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_AESADVHP_INTERRUPT
     *
     *  @return     Which of the requested and enabled AESADVHP interrupts are pending
     *
     *  @retval     Bitwise OR of @ref DL_AESADVHP_INTERRUPT
     *
     *  @sa         DL_AESADVHP_enableInterrupt
     */
    __STATIC_INLINE uint32_t DL_AESADVHP_getEnabledInterruptStatus( const AESADVHP_Regs *aesadv, uint32_t interruptMask )
    {
        return ( aesadv->INT_EVENT0.MIS & interruptMask );
    }

    /**
     *  @brief      Check interrupt flag of any AESADVHP interrupts
     *
     *  Checks if any of the AESADVHP interrupts are pending. Interrupts do not have
     *  to be previously enabled.
     *
     *  @param[in]  aesadv         Pointer to the register overlay for the
     *                             peripheral
     *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
     *                             @ref DL_AESADVHP_INTERRUPT
     *
     *  @return     Which of the requested AESADVHP interrupts are pending
     *
     *  @retval     Bitwise OR of @ref DL_AESADVHP_INTERRUPT
     */
    __STATIC_INLINE uint32_t DL_AESADVHP_getRawInterruptStatus( const AESADVHP_Regs *aesadv, uint32_t interruptMask )
    {
        return ( aesadv->INT_EVENT0.RIS & interruptMask );
    }

    /**
     *  @brief      Get highest priority pending AESADVHP interrupt
     *
     *  Checks if any AESADVHP interrupts are pending. Interrupt does not have to
     *  be previously enabled.
     *
     *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
     *
     *  @return     The highest priority pending AESADVHP interrupt
     *
     *  @retval     One of @ref DL_AESADVHP_IIDX
     */
    __STATIC_INLINE DL_AESADVHP_IIDX DL_AESADVHP_getPendingInterrupt( const AESADVHP_Regs *aesadv )
    {
        return ( ( DL_AESADVHP_IIDX ) aesadv->INT_EVENT0.IIDX );
    }

    /**
     *  @brief      Clear pending AESADVHP Interrupts
     *
     *  @param[in]  aesadv         Pointer to the register overlay for the
     *                             peripheral
     *  @param[in]  interruptMask  Bit mask of interrupts to clear. Bitwise OR of
     *                             @ref DL_AESADVHP_INTERRUPT
     */
    __STATIC_INLINE void DL_AESADVHP_clearInterruptStatus( AESADVHP_Regs *aesadv, uint32_t interruptMask )
    {
        aesadv->INT_EVENT0.ICLR = interruptMask;
    }

    /**
     *  @brief      Enables DMA input trigger to publish AESADVHP write requests to
     *              the DMA
     *
     *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
     */
    __STATIC_INLINE void DL_AESADVHP_enableDMAInputTriggerEvent( AESADVHP_Regs *aesadv )
    {
        aesadv->INT_EVENT1.IMASK |= DL_AESADVHP_EVENT_DMA_DATA_INPUT_TRIGGER;
    }

    /**
     *  @brief      Enables DMA output trigger to publish AESADVHP read requests to
     *              the DMA
     *
     *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
     */
    __STATIC_INLINE void DL_AESADVHP_enableDMAOutputTriggerEvent( AESADVHP_Regs *aesadv )
    {
        aesadv->INT_EVENT2.IMASK |= DL_AESADVHP_EVENT_DMA_DATA_OUTPUT_TRIGGER;
    }

    /**
     *  @brief      Disable DMA input trigger event
     *
     *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
     */
    __STATIC_INLINE void DL_AESADVHP_disableDMAInputTriggerEvent( AESADVHP_Regs *aesadv )
    {
        aesadv->INT_EVENT1.IMASK &= ~( DL_AESADVHP_EVENT_DMA_DATA_INPUT_TRIGGER );
    }

    /**
     *  @brief      Disable DMA output trigger event
     *
     *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
     */
    __STATIC_INLINE void DL_AESADVHP_disableDMAOutputTriggerEvent( AESADVHP_Regs *aesadv )
    {
        aesadv->INT_EVENT2.IMASK &= ~( DL_AESADVHP_EVENT_DMA_DATA_OUTPUT_TRIGGER );
    }

    /**
     *  @brief      Check if the DMA input trigger event is enabled
     *
     *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
     *
     *  @return     If DMA input trigger event is enabled
     *
     *  @retval     DL_AESADVHP_EVENT_DMA_DATA_INPUT_TRIGGER if DMA input trigger
     *              event is enabled
     *  @retval     0 if DMA input trigger event is not enabled
     */
    __STATIC_INLINE uint32_t DL_AESADVHP_getEnabledDMAInputTriggerEvent( const AESADVHP_Regs *aesadv )
    {
        return ( aesadv->INT_EVENT1.IMASK & DL_AESADVHP_EVENT_DMA_DATA_INPUT_TRIGGER );
    }

    /**
     *  @brief      Check if the DMA output trigger event is enabled
     *
     *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
     *
     *  @return     If DMA output trigger event is enabled
     *
     *  @retval     DL_AESADVHP_EVENT_DMA_DATA_OUTPUT_TRIGGER if DMA output trigger
     *              event is enabled
     *  @retval     0 if DMA output trigger event is not enabled
     */
    __STATIC_INLINE uint32_t DL_AESADVHP_getEnabledDMAOutputTriggerEvent( const AESADVHP_Regs *aesadv )
    {
        return ( aesadv->INT_EVENT2.IMASK & DL_AESADVHP_EVENT_DMA_DATA_OUTPUT_TRIGGER );
    }

    /**
     *  @brief      Check interrupt flag of DMA input trigger event
     *
     *  Checks if DMA input trigger event that was previously enabled is pending.
     *
     *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
     *
     *  @return     If DMA input trigger event is pending
     *
     *  @retval     DL_AESADVHP_EVENT_DMA_DATA_INPUT_TRIGGER if DMA input trigger
     *              event is pending
     *  @retval     0 if DMA input trigger event is not pending
     *
     *  @sa         DL_AESADVHP_enableDMAInputTriggerEvent
     */
    __STATIC_INLINE uint32_t DL_AESADVHP_getEnabledDMAInputTriggerEventStatus( const AESADVHP_Regs *aesadv )
    {
        return ( aesadv->INT_EVENT1.MIS & DL_AESADVHP_EVENT_DMA_DATA_INPUT_TRIGGER );
    }

    /**
     *  @brief      Check interrupt flag of DMA output trigger event
     *
     *  Checks if DMA output trigger event that was previously enabled is pending.
     *
     *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
     *
     *  @return     If DMA output trigger event is pending
     *
     *  @retval     DL_AESADVHP_EVENT_DMA_DATA_OUTPUT_TRIGGER if DMA output trigger
     *              event is pending
     *  @retval     0 if DMA output trigger event is not pending
     *
     *  @sa         DL_AESADVHP_enableDMAOutputTriggerEvent
     */
    __STATIC_INLINE uint32_t DL_AESADVHP_getEnabledDMAOutputTriggerEventStatus( const AESADVHP_Regs *aesadv )
    {
        return ( aesadv->INT_EVENT2.MIS & DL_AESADVHP_EVENT_DMA_DATA_OUTPUT_TRIGGER );
    }

    /**
     *  @brief      Check interrupt flag of DMA input trigger event
     *
     *  Checks if DMA input trigger event is pending. Event does not have to
     *  be previously enabled.
     *
     *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
     *
     *  @return     If DMA input trigger event is pending
     *
     *  @retval     DL_AESADVHP_EVENT_DMA_DATA_INPUT_TRIGGER if DMA input trigger event is
     *              pending
     *  @retval     0 if DMA input trigger event is not pending
     */
    __STATIC_INLINE uint32_t DL_AESADVHP_getRawDMAInputTriggerEventStatus( const AESADVHP_Regs *aesadv )
    {
        return ( aesadv->INT_EVENT1.RIS & DL_AESADVHP_EVENT_DMA_DATA_INPUT_TRIGGER );
    }

    /**
     *  @brief      Check interrupt flag of DMA output trigger event
     *
     *  Checks if DMA output trigger event is pending. Event does not have to
     *  be previously enabled.
     *
     *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
     *
     *  @return     If DMA output trigger event is pending
     *
     *  @retval     DL_AESADVHP_EVENT_DMA_DATA_INPUT_TRIGGER if DMA output trigger event is
     *              pending
     *  @retval     0 if DMA output trigger event is not pending
     */
    __STATIC_INLINE uint32_t DL_AESADVHP_getRawDMAOutputTriggerEventStatus( const AESADVHP_Regs *aesadv )
    {
        return ( aesadv->INT_EVENT2.RIS & DL_AESADVHP_EVENT_DMA_DATA_OUTPUT_TRIGGER );
    }

    /**
     *  @brief      Get highest priority pending DMA input trigger event
     *
     *  Checks if DMA input trigger event is pending. Event does not have to
     *  be previously enabled.
     *
     *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
     *
     *  @return     The highest priority pending DMA input trigger event
     */
    __STATIC_INLINE DL_AESADVHP_IIDX DL_AESADVHP_getPendingDMAInputTriggerEvent( const AESADVHP_Regs *aesadv )
    {
        uint32_t eventIIDX = aesadv->INT_EVENT1.IIDX;

        return ( DL_AESADVHP_IIDX ) eventIIDX;
    }

    /**
     *  @brief      Get highest priority pending DMA output trigger event
     *
     *  Checks if DMA output trigger event is pending. Event does not have to
     *  be previously enabled.
     *
     *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
     *
     *  @return     The highest priority pending DMA output trigger event
     */
    __STATIC_INLINE DL_AESADVHP_IIDX DL_AESADVHP_getPendingDMAOutputTriggerEvent( const AESADVHP_Regs *aesadv )
    {
        uint32_t eventIIDX = aesadv->INT_EVENT2.IIDX;

        return ( DL_AESADVHP_IIDX ) ( eventIIDX );
    }

    /**
     *  @brief      Clear pending DMA input trigger event
     *
     *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
     */
    __STATIC_INLINE void DL_AESADVHP_clearDMAInputTriggerEventStatus( AESADVHP_Regs *aesadv )
    {
        aesadv->INT_EVENT1.ICLR = DL_AESADVHP_EVENT_DMA_DATA_INPUT_TRIGGER;
    }

    /**
     *  @brief      Clear pending DMA output trigger event
     *
     *  @param[in]  aesadv      Pointer to the register overlay for the peripheral
     */
    __STATIC_INLINE void DL_AESADVHP_clearDMAOutputTriggerEventStatus( AESADVHP_Regs *aesadv )
    {
        aesadv->INT_EVENT2.ICLR = DL_AESADVHP_EVENT_DMA_DATA_OUTPUT_TRIGGER;
    }

    /**
     *  @brief Returns the address of the AESADVHP input data register.
     *
     *  This API can be used with @ref DL_DMA_setDestAddr to set the destination
     *  address when using DMA transfers. The Data should be written as 128-bit
     *  block writes (4 32-bit words) to a region of memory starting at the provided
     *  address.
     *      Use with the @ref DL_AESADVHP_enableDMAOperation
     *      The DMA output request use @ref DL_AESADVHP_EVENT_DMA_DATA_OUTPUT_TRIGGER
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @return Address of the AESADVHP input data register
     *
     *  @sa DL_AESADVHP_enableDMAOperation
     */
    __STATIC_INLINE uintptr_t DL_AESADVHP_getDATAINAddr( const AESADVHP_Regs *aesadv )
    {
        return ( ( uintptr_t ) &aesadv->DATA0 );
    }

    /**
     *  @brief Returns the address of the AESADVHP output data register.
     *
     *  This API can be used with @ref DL_DMA_setDestAddr to set the destination
     *  address when using DMA transfers. The Data should be read as 128-bit
     *  block read (4 32-bit words) to a region of memory starting at the provided
     *  address.
     *      Use with the @ref DL_AESADVHP_enableDMAOperation
     *      The DMA output request use @ref DL_AESADVHP_EVENT_DMA_DATA_OUTPUT_TRIGGER
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *
     *  @return Address of the AESADVHP output data register
     *
     *  @sa DL_AESADVHP_enableDMAOperation
     */
    __STATIC_INLINE uintptr_t DL_AESADVHP_getDATAOUTAddr( const AESADVHP_Regs *aesadv )
    {
        return ( ( uintptr_t ) &aesadv->DATA0 );
    }

    /**
     *  @brief Initializes the engine in the Electronic Codebook (ECB) mode
     *
     *  This function is designed to place the engine in Electronic Codebook (ECB)
     *  mode with all necessary control context.
     *      The primary key, however, must be set into the AES engine before this
     *  function is called. This is because the key could come from either the
     *  KEYSTORECTL or from plaintext depending on system setting.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] config       Pointer to configuration struct with valid values
     *                          for: direction, lowerCryptoLength, upperCryptoLength
     *
     *  @sa DL_AESADVHP_setKey
     */
    void DL_AESADVHP_initECB( AESADVHP_Regs *aesadv, const DL_AESADVHP_Config *config );

    /**
     *  @brief Initializes the engine in the Cipher-Block Chaining (CBC) mode
     *
     *  This function is designed to place the engine in Cipher Block Chaining (CBC)
     *  mode with all necessary control context.
     *      The primary key, however, must be set into the AES engine before this
     *  function is called. This is because the key could come from either the
     *  KEYSTORECTL or from plaintext depending on system setting.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] config       Pointer to configuration struct with valid values
     *                          for: direction, iv, lowerCryptoLength,
     *                               upperCryptoLength
     *
     *  @sa DL_AESADVHP_setKey
     */
    void DL_AESADVHP_initCBC( AESADVHP_Regs *aesadv, const DL_AESADVHP_Config *config );

    /**
     *  @brief Initializes the engine in the Cipher Feedback (CFB) mode
     *
     *  This function is designed to place the engine in Cipher Feedback (CFB) mode
     *  with all necessary control context.
     *      The primary key, however, must be set into the AES engine before this
     *  function is called. This is because the key could come from either the
     *  KEYSTORECTL or from plaintext depending on system setting.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] config       Pointer to configuration struct with valid values
     *                          for: direction, iv, lowerCryptoLength, upperCryptoLength,
     *                               cfb_fbWidth
     *
     *  @sa DL_AESADVHP_setKey
     */
    void DL_AESADVHP_initCFB( AESADVHP_Regs *aesadv, const DL_AESADVHP_Config *config );

    /**
     *  @brief Initializes the engine in the Output Feedback (OFB) mode
     *
     *  This function is designed to place the engine in Output Feedback (OFB) mode
     *  with all necessary control context.
     *      The primary key, however, must be set into the AES engine before this
     *  function is called. This is because the key could come from either the
     *  KEYSTORECTL or from plaintext depending on system setting.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] config       Pointer to configuration struct with valid values
     *                          for: direction, iv, lowerCryptoLength,
     *                               upperCryptoLength
     *
     *  @sa DL_AESADVHP_setKey
     */
    void DL_AESADVHP_initOFB( AESADVHP_Regs *aesadv, const DL_AESADVHP_Config *config );

