TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_aesadvhp.h
    /**
     *  @brief Initializes the engine in the Counter (CTR) mode
     *
     *  This function is designed to place the engine in Counter (CTR) mode with all
     *  necessary control context.
     *      The primary key, however, must be set into the AES engine before this
     *  function is called. This is because the key could come from either the
     *  KEYSTORECTL or from plaintext depending on system setting.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] config       Pointer to configuration struct with valid values
     *                          for: direction iv, lowerCryptoLength,
     *                               upperCryptoLength, ctr_ctrWidth. IV is
     *                               typically 0x00000001
     *
     *  @sa DL_AESADVHP_setKey
     */
    void DL_AESADVHP_initCTR( AESADVHP_Regs *aesadv, const DL_AESADVHP_Config *config );

    /**
     *  @brief Initializes the engine in the Integer Counter Mode (ICM)
     *
     *  This function is designed to place the engine in Integer Counter Mode (ICM)
     *  with all necessary control context. ICM is a variant of CTR mode with a 16-
     *  bit wide counter value.
     *      The primary key, however, must be set into the AES engine before this
     *  function is called. This is because the key could come from either the
     *  KEYSTORECTL or from plaintext depending on system setting.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] config       Pointer to configuration struct with valid values
     *                          for: direction iv, lowerCryptoLength,
     *                               upperCryptoLength. IV is typically 0x00000001
     *
     *  @sa DL_AESADVHP_setKey
     */
    void DL_AESADVHP_initICM( AESADVHP_Regs *aesadv, const DL_AESADVHP_Config *config );

    /**
     *  @brief Initializes the engine in the block cipher-based Message
     *         Authentication Code (CMAC)
     *
     *  This function is designed to place the engine in block cipher-based Message
     *  Authentication Code: CMAC. CMAC is strictly authentication and does not
     *  generate any ciphertext or plaintext, but only a tag. CMAC is also
     *  recommended by NIST in SP 800-38B for authentication. It consists of a
     *  primary key as well as derived keys K1 and K2 which must be provided in
     *  the configuration. The engine will not derive K1 and K2, and these must be
     *  calculated beforehand and included in the config struct.
     *      The primary key from which K1 and K2 are derived, however, must be set
     *  in the AES engine before this function is called. This is because the key
     *  could come from either the KEYSTORECTL or from plaintext depending on
     *  system setting.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] config       Pointer to configuration struct with valid values
     *                          for: K1, K2, lowerCryptoLength, upperCryptoLength.
     *
     *  @sa DL_AESADVHP_setKey
     */
    void DL_AESADVHP_initCMAC( AESADVHP_Regs *aesadv, const DL_AESADVHP_Config *config );

    /**
     *  @brief Initializes the engine in the Cipher Block Chaining Message
     *         Authenication Code (CBC-MAC)
     *
     *  This function is designed to place the engine in Cipher Block Chaining
     *  Message Authenication Code (CBC-MAC). CBC-MAC is strictly authentication and
     *  does not generate any ciphertext or plaintext, but only a tag.
     *      The primary key, however, must be set into the AES engine before this
     *  function is called. This is because the key could come from either the
     *  KEYSTORECTL or from plaintext depending on system setting.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] config       Pointer to configuration struct with valid values
     *                          for: lowerCryptoLength, upperCryptoLength.
     *
     *  @sa DL_AESADVHP_setKey
     */
    void DL_AESADVHP_initCBCMAC( AESADVHP_Regs *aesadv, const DL_AESADVHP_Config *config );

    /**
     *  @brief Initializes the engine in the Galois/Counter Mode (GCM)
     *
     *  This function is designed to place the engine in Galois/Counter Mode (GCM).
     *  GCM is both authentication and data encryption, and will generate both
     *  ciphertext/plaintext and the corresponding tag.
     *      The primary key and hash key (if expected from @ref DL_AESADVHP_MODE) must
     *  be set into the AES engine before this function is called. This is because
     *  the key could come from either the KEYSTORECTL or from plaintext depending
     *  on system setting.
     *      After this function has completed, the user is to first input all
     *  additional authentication data (AAD) before entering the crypto payload.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] config       Pointer to configuration struct with valid values
     *                          for: mode (one of the GCM operations), direction,
     *                               iv, lowerCryptoLength, upperCryptoLength,
     *                               aadLength. IV is
     *                               typically 0x00000001. The maximum length in
     *                               bytes is 2^36 - 32.
     *
     *  @sa DL_AESADVHP_setKey
     *  @sa DL_AESADVHP_setHashKey
     */
    void DL_AESADVHP_initGCM( AESADVHP_Regs *aesadv, const DL_AESADVHP_Config *config );

    /**
     *  @brief Initializes the engine in the Counter & CBC-MAC (CCM)mode
     *
     *  This function is designed to place the engine in Counter and Cipher-Block
     *  Chaining Message Authentication Code (CCM) mode.
     *  CCM is both authentication and data encryption, and will generate both
     *  ciphertext/plaintext and the corresponding tag.
     *      To calculate the length of the nonce and the counter width, please refer
     *  to @ref DL_AESADVHP_loadCCMNonceAndCounter.
     *      After this function has completed, the user is to first input all
     *  additional authentication data (AAD) before entering the crypto payload.
     *
     *  @param[in] aesadv       Pointer to the register overlay for the peripheral
     *  @param[in] config       Pointer to configuration struct with valid values
     *                          for: direction, nonce, ccm_ctrWidth, ccm_tagWidth,
     *                               lowerCryptoLength, upperCryptoLength, aadLength
     *                               IV is typically 0x00000001. The maximum AAD
     *                               Length is 2^16-2^8
     *
     *  @sa DL_AESADVHP_setKey
     */
    void DL_AESADVHP_initCCM( AESADVHP_Regs *aesadv, const DL_AESADVHP_Config *config );

#ifdef __cplusplus
}
#endif

#endif /* __MSP_HAS_AESADVHP__ */

#endif /* ti_dl_dl_aesadv__include */
/** @}*/
